Repository: 5l1v3r1/GetIt
Catalog: po/*.po
Languages: it, nl

source: GetIt's main focus is to make your life a lot easier when you have to test APIs or use somebody elses API. We know it can be hard to find a great, simple and open source application for this task that's not command line based.
it: L'obiettivo principale di GetIt è rendere la tua vita molto più semplice quando devi testareAPI o utilizzare qualche altra API. Sappiamo che può essere difficile trovare un ottimaapplicazione semplice e open source per questa attività che non sia basato sulla riga dicomando.

source: You can send numerous requests to a webserver. You can send RAW post data, form post data, add cookies to your request and add headers to your request.
it: Puoi inviare numerose richieste a un server web. Puoi inviare dati di post RAWmodelli dati post, aggiungi cookie alla tua richiesta e aggiungi intestazioni alla tua richiesta.
nl: Je kunt verschillende typen requests naar een webserver sturen. Je kunt ruwe post data sturen, form post data, cookiesaan je request toevoegen en verschillende headers aan je request toevoegen.

source: The response can be viewed either as syntax highlighted code, with JSON even being made readable, as the raw output, which means no syntax highlighting, and view it in a webview.
it: La risposta può essere visualizzata come codice evidenziato dalla sintassi, anche con JSONdeve essere reso leggibile, come output non elaborato, il che significa che nessun evidenziazione della sintassie vista in una visualizzazione Web.
nl: De response kan worden bekeken als opgemaakte code, waarbij JSON zelfs leesbaar wordt gemaakt, als de rauwe output, wat inhoudt dat de code niet wordt opgemaakt, en je kunt de response in een webview bekijken.

source: Features of GetIt include:
it: Le caratteristiche di GetIt includono:
nl: Features van GetIt zijn onder andere:

source: Sending HTTP requests to API endpoints and display the response of the server
it: Invio di richieste HTTP agli endpoint API e visualizzazione della risposta del server
nl: HTTP Requests naar API endpoints versturen en de response van de server weergeven

source: Saving and opening requests
it: Salvataggio e apertura richieste
nl: Requests opslaan en openen

source: Easily open recent saved/opened requests
it: Apri facilmente le richieste salvate/aperte recentemente
nl: Gemakkelijk recent opgeslagen/geopende requests openen

source: Sending custom POST data
it: Invio di dati POST personalizzati
nl: Aangepaste POST data versturen

source: Syntax highlighting for all responses
it: Evidenziazione della sintassi per tutte le risposte
nl: Code opmaak voor alle response types

source: Preview for HTML response
it: Anteprima per la risposta HTML
nl: Voorbeeld voor HTML response

source: Make JSON response look beautifull automatically
it: Rendi automaticamente bella la risposta JSON
nl: JSON response automatisch leesbaar maken

source: Add default information about the request
it: Aggiungi informazioni predefinite sulla richiesta

source: Add cookies to the request
it: Aggiungi i cookie alla richiesta

source: Add headers to the request
it: Aggiungi intestazioni alla richiesta

source: Display the response of the request
it: Visualizza la risposta della richiesta

source: Display the HTML response as a webpage
it: Visualizza la risposta HTML come pagina Web

source: Send HTTP requests to API endpoints
it: Invia richieste HTTP agli endpoint API
nl: Verstuur HTTP reqests naar API endpoints

source: Request;HTTP;API;
it: Richiesta;HTTP;API;

source: New Window
it: Nuova Finestra
nl: Nieuw Venster

source: Display screen with recent requests on application startup
it: Mostra richieste recenti all'avvio dell'applicazione
nl: Scherm met recente requests weergeven als de applicatie wordt opgestart

source: When set to true the recent requests window will always be shown when the application is launched. Either way it can still be launched from the application menu.
it: Se impostato su vero, la finestra delle richieste recenti verrà sempre visualizzata quandol'applicazione viene avviata. In entrambi i casi può ancora essere avviata dal
nl: Als deze instelling aan wordt gezet dan wordt het venster met recente requests getoond als de applicatie wordt gestart. Het recente requests scherm kan hoe dan ook gestart worden via het applicatiemenu.

source: Display notifications when a request has been sent
it: Visualizza le notifiche quando è stata inviata una richiesta
nl: Notificatie tonen als een request is verzonden

source: When this setting is enabled GetIt will show a notification everytime a request has been sent or when the timeout has been reached.
it: Quando questa impostazione è abilitata, GetIt mostrerà una notifica ogni volta che unarichiesta è stata inviata o quando è stato raggiunto il timeout.
nl: Als deze instelling is ingeschakeld weergeeft GetIt een notificatie iedere keer als een request is verzonden of als er een time-out heeft plaats gevonden.

source: Timeout request after given seconds
it: Richiesta di timeout dopo determinati secondi
nl: Time-out een request na gegeven seconden

source: When a request is taking too long to get a response from the server it can be cancled within the given timeout. When timeout is set to 0 the request will go on forever.
it: Quando una richiesta impiega troppo tempo per ottenere una risposta dal server, puòessere escluso entro il timeout specificato. Quando il timeout è impostato su 0, la richiestaandrà avanti per sempre.
nl: Als een request er te lang over doet om een antwoord van de server te krijgen kan de request automatisch worden geannuleerd door een time-out. Als de time-out wordt ingesteld op 0 dan zal het request oneindig doorgaan.

source: User agent to send along with each request
it: Agente utente da inviare insieme ad ogni richiesta
nl: User agent die wordt meegegeven met een request

source: The given user agent will be sent along with each request.
it: L'agente utente fornito verrà inviato insieme a ciascuna richiesta.
nl: De gegeven user agent wordt met ieder request meegestuurd.

source: Value of which the divider is set
it: Valore di cui è impostato il divisore
nl: Waarde waarmee de splitsing wordt gezet

source: This value is used to place the divider between the headers and the output of a request
it: Questo valore viene utilizzato per posizionare il divisore tra le intestazioni e l'outputdi una richiesta
nl: Deze waarde wordt gebruikt om de splitsing tussen the headers en deuitvoer van een request te bepalen

source: Add Key Value Pair
it: Aggiungi coppia valore-chiave
nl: Key Value waardes toevoegen

source: Form Data
it: Dati Modulo

source: Text
it: Testo
nl: Tekst

source: Validate X.509 Certificates
it: Convalida certificati X.509

source: Add Cookie
it: Aggiungi cookie
nl: Cookie Toevoegen

source: Add Header
it: Aggiungi intestazione
nl: Header Toevoegen

source: <big>Please send a request...</big>
it: <big>Si prega di inviare una richiesta...</big>
nl: <big>Verstuur een request...</big>

source: <big>Sending request...</big>
it: <big>Request wordt verzonden...</big>
nl: <big>Request aan het versturen...</big>

source: <big>An error has occured</big>
it: <big>si è verificato un errore</big>
nl: <big>Er is een error opgetreden...</big>

source: Something went wrong sending your request...
it: Si è verificato un errore durante l'invio della richiesta...
nl: Er is iets misgegaan tijdens het versturen van je request...

source: <big>The request has timed out</big>
it: <big>De request is ge-timed-out</big>
nl: <big>De request heeft is ge-timed-out</big>

source: The timeout of a request can be set in the preferences window. To disable the timeout completly set the value to 0.
it: Il timeout di una richiesta può essere impostato nella finestra delle preferenze. Per disabilitareil timeout imposta completamente il valore su 0.
nl: De time-out van een request kan worden aangepast in het instellingenscherm. Om de time-out compleet uit te schakelen zet deze dan op 0.

source: Pretty
it: Bello
nl: Opgemaakt

source: Preview
it: Anteprima
nl: Voorbeeld

source: GetIt is a small application to send HTTP requests
it: GetIt è una piccola applicazione per inviare richieste HTTP
nl: GetIt is een applicatie om HTTP requests te versturen

source: Apply
it: Applica
nl: Toepassen

source: Display notifications
it: Mostra notifiche
nl: Notificaties weergeven

source: User Agent
it: Agente Utente

source: Show recents on startup
it: Mostra i recenti all'avvio
nl: Recente requests tijdens opstarten

source: Key
it: Chiave

source: Value
it: Valore
nl: Waarde

source: Choose File...
it: Scegli FIle...
nl: Kies Bestand...

source: _Recent
it: _Recente

source: _Preferences
it: _Preferenze
nl: _Instellingen

source: _Shortcuts
it: _Scorciatoie
nl: _Sneltoetsen

source: _About
it: _Informazioni
nl: _Over

source: _Quit
it: _Esci
nl: _Sluiten

source: Open
it: Opri
nl: Openen

source: Save As
it: Salva Come
nl: Opslaan Als

source: Save
it: Salva
nl: Opslaan

source: Clear Request
it: Cancella Richiesta
nl: Request Legen

source: File: (null)
it: FIle: (nullo)
nl: Bestand: (null)

source: Send
it: Invia
nl: Verstuur

source: Send request (ctrl + return)
it: Invia richiesta (Ctrl + Invio)
nl: Verstuur request (ctrl + enter)

source: Cancel
it: Cancella
nl: Annuleren

source: Cancel running request (esc)
it: Annulla richiesta in esecuzione (esc)
nl: Annuleer huidige request (esc)

source: Shortcuts
it: Scorciatoie
nl: Sneltoetsen

source: Request
it: Richiesta

source: Send request
it: Invia richiesta
nl: Request versturen

source: Cancel running request
it: Annulla la richiesta in esecuzione
nl: Annuleer het lopende request

source: Save the request as
it: Salva la richiesta come
nl: Request opslaan als

source: Save the request
it: Salva la richiesta
nl: Request opslaan

source: Open a request
it: Apri una richiesta
nl: Request openen

source: <big>Invalid X.509 Certificate</big>
it: <big>Certificato X.509 non valido</big>

source: The server responded with an invalid X.509 certificate
it: Il server ha risposto con un certificato X.509 non valido

source: Application
it: Applicazione

source: GetIt&#39;s main focus is to make your life a lot easier when you have to test APIs or use somebody elses API. We know it can be hard to find a great, simple and open source application for this task that&#39;s not command line based.
nl: GetIt&#39;s hoofdtaak is om jouw leven gemakkelijker te maken als je API&#39;s moet testen of de API van iemand ander gebruikt. Wij weten dat het moeilijk kan zijn om een goede, simpele en ook open source applicatie te vinden voor deze taak die niet gebaseerd is op de command line.

source: Raw
nl: Ruwe data

source: File
nl: Bestand

source: GetIt Files
nl: GetIt Bestanden

source: Recent Requests
nl: Recente requests

source: Open Request
nl: Request openen

source: Are you sure you want to clear the request?
nl: Weet je zeker dat je het huidige request wilt legen?

source: Something went wrong saving the file&#8230;
nl: Er is iets misgegaan tijdens het opslaan van het bestand&#8230;

source: Something went wrong opening the file&#8230;
nl: Er is iets misgegaan tijdens het openen van het bestand&#8230;

source: Something went wrong sending your request&#8230;
nl: Er is iets misgegaan tijdens het versturen van je request&#8230;

source: File:
nl: Bestand:

source: Request timed out
nl: Request is ge-timed-out

source: Request sent
nl: Request is verzonden

source: Save Request
nl: Request opslaan
